In [80]:
import math
import sys, os
import numpy as np
import pandas as pd
import watermark

In [81]:
sys.path.append(os.path.abspath(os.path.join('modulos')))
from estrategia1 import *
from estrategia2 import *
from estrategia3 import *

In [82]:
pd.set_option('display.max_columns', 100)

## Carregando os Dados

In [84]:
# Criamos uma lista para identificar valores ausentes
lista_labels_valores_ausentes = ["n/a", "na", "non-null", "undefined"]

In [85]:
dataset = pd.read_csv("dados/dataset.csv", na_values = lista_labels_valores_ausentes)

In [86]:
# Shape
dataset.shape

(45211, 19)

In [87]:
dataset.head()

,customerid,age,salary,balance,marital,jobedu,targeted,default,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,response
0,1,58.0,100000.0,2143,married,"management,tertiary",yes,no,yes,no,unknown,5,"may, 2017",261 sec,1,-1,0,unknown,no
1,2,44.0,60000.0,29,single,"technician,secondary",yes,no,yes,no,unknown,5,"may, 2017",151 sec,1,-1,0,unknown,no
2,3,33.0,120000.0,2,married,"entrepreneur,secondary",yes,no,yes,yes,unknown,5,"may, 2017",76 sec,1,-1,0,unknown,no
3,4,47.0,20000.0,1506,married,"blue-collar,unknown",no,no,yes,no,unknown,5,"may, 2017",92 sec,1,-1,0,unknown,no
4,5,33.0,0.0,1,single,"unknown,unknown",no,no,no,no,unknown,5,"may, 2017",198 sec,1,-1,0,unknown,no

### Analise Exploratoria

In [89]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 19 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   customerid  45211 non-null  int64
 1   age         45191 non-null  float64
 2   salary      45185 non-null  float64
 3   balance     45211 non-null  int64
 4   marital     45211 non-null  object
 5   jobedu      45211 non-null  object
 6   targeted    45211 non-null  object
 7   default     45211 non-null  object
 8   housing     45211 non-null  object
 9   loan        45211 non-null  object
 10  contact     45211 non-null  object
 11  day         45211 non-null  int64
 12  month       45161 non-null  object
 13  duration    45211 non-null  object
 14  campaign    45211 non-null  int64
 15  pdays       45211 non-null  int64
 16  previous    45211 non-null  int64
 17  poutcome    45211 non-null  object
 18  response    45181 non-null  object
dtypes: float64(2), int64(6), object(11)
memory usage: 6.6+ MB

In [90]:
dataset.describe()

,customerid,age,salary,balance,day,campaign,pdays,previous
count,45211.000000,45191.000000,45185.000000,45211.000000,45211.000000,45211.000000,45211.000000,45211.000000
mean,22606.000000,40.935651,57008.653314,1362.272058,15.806419,2.763841,40.197828,0.580323
std,13051.435847,10.619198,32086.028522,3044.765829,8.322476,3.098021,100.128746,2.303441
min,1.000000,18.000000,0.000000,-8019.000000,1.000000,1.000000,-1.000000,0.000000
25%,11303.500000,33.000000,20000.000000,72.000000,8.000000,1.000000,-1.000000,0.000000
50%,22606.000000,39.000000,60000.000000,448.000000,16.000000,2.000000,-1.000000,0.000000
75%,33908.500000,48.000000,70000.000000,1428.000000,21.000000,3.000000,-1.000000,0.000000
max,45211.000000,95.000000,120000.000000,102127.000000,31.000000,63.000000,871.000000,275.000000

In [91]:
dataset.shape

(45211, 19)

### Estratégia de Limpeza 1 - Tratamento de Valores Ausentes

- 1- Identificando Valores Ausentes
- 2- Drop de Colunas
- 3- Imputação com Preenchimento Reverso
- 4- Imputação com Preenchimento Progressivo
- 5- Imputação de Variáveis Categóricas
- 6- Drop de Linhas

In [93]:
func_calc_percentual_valores_ausentes(dataset)

O dataset tem 0.01 % de valores ausentes.

In [94]:
df_missing = func_calc_percentual_valores_ausentes_coluna(dataset)

O dataset tem 19 colunas.
Encontrado: 4 colunas que têm valores ausentes.

In [95]:
df_missing

          Valores Ausentes  % de Valores Ausentes    Dtype
month                   50                   0.11   object
response                30                   0.07   object
salary                  26                   0.06  float64
age                     20                   0.04  float64

In [96]:
colunas_para_remover = df_missing[df_missing['% de Valores Ausentes'] >= 30.00].index.tolist()

In [97]:
colunas_para_remover

[]

In [98]:
func_calc_percentual_valores_ausentes(dataset)

O dataset tem 0.01 % de valores ausentes.

In [99]:
func_calc_percentual_valores_ausentes_coluna(dataset)

O dataset tem 19 colunas.
Encontrado: 4 colunas que têm valores ausentes.

          Valores Ausentes  % de Valores Ausentes    Dtype
month                   50                   0.11   object
response                30                   0.07   object
salary                  26                   0.06  float64
age                     20                   0.04  float64

### Find and handle values in columns, and treat all values. 
 - Define the dataset with df
 - Print results with "isnull().sum
 - Count Values

In [102]:
df = dataset

In [104]:
print(df.isnull().sum())

customerid     0
age           20
salary        26
balance        0
marital        0
jobedu         0
targeted       0
default        0
housing        0
loan           0
contact        0
day            0
month         50
duration       0
campaign       0
pdays          0
previous       0
poutcome       0
response      30
dtype: int64

In [110]:
df_missing = dataset[['age', 'salary', 'month', 'response']]

In [112]:
print(df_missing.isnull().sum())

age         20
salary      26
month       50
response    30
dtype: int64

In [114]:
df_missing.head()

    age    salary      month response
0  58.0  100000.0  may, 2017       no
1  44.0   60000.0  may, 2017       no
2  33.0  120000.0  may, 2017       no
3  47.0   20000.0  may, 2017       no
4  33.0       0.0  may, 2017       no

### "Handle missing data in the dataset!"
 - Columns age and salary it is numerical

In [119]:
# Preencher valores ausentes em 'age' e 'salary' com a média
dataset['age'].fillna(dataset['age'].mean(), inplace=True)
dataset['salary'].fillna(dataset['salary'].mean(), inplace=True)

In [121]:
# Preencher valores ausentes em 'month' e 'response' com a moda
dataset['month'].fillna(dataset['month'].mode()[0], inplace=True)
dataset['response'].fillna(dataset['response'].mode()[0], inplace=True)

In [123]:
print(df.isnull().sum())

customerid    0
age           0
salary        0
balance       0
marital       0
jobedu        0
targeted      0
default       0
housing       0
loan          0
contact       0
day           0
month         0
duration      0
campaign      0
pdays         0
previous      0
poutcome      0
response      0
dtype: int64

In [125]:
func_calc_percentual_valores_ausentes(dataset)

O dataset tem 0.0 % de valores ausentes.

In [127]:
# Verificar resumo estatístico do dataset
print(dataset.describe())

         customerid           age         salary        balance           day  \
count  45211.000000  45211.000000   45211.000000   45211.000000  45211.000000
mean   22606.000000     40.935651   57008.653314    1362.272058     15.806419
std    13051.435847     10.616848   32076.800953    3044.765829      8.322476
min        1.000000     18.000000       0.000000   -8019.000000      1.000000
25%    11303.500000     33.000000   20000.000000      72.000000      8.000000
50%    22606.000000     39.000000   60000.000000     448.000000     16.000000
75%    33908.500000     48.000000   70000.000000    1428.000000     21.000000
max    45211.000000     95.000000  120000.000000  102127.000000     31.000000

           campaign         pdays      previous
count  45211.000000  45211.000000  45211.000000
mean       2.763841     40.197828      0.580323
std        3.098021    100.128746      2.303441
min        1.000000     -1.000000      0.000000
25%        1.000000     -1.000000      0.000000
50%        2.000000     -1.000000      0.000000
75%        3.000000     -1.000000      0.000000
max       63.000000    871.000000    275.000000

In [129]:
dataset['salary'] = dataset['salary'].replace(0, np.nan)
dataset['salary'].fillna(dataset['salary'].median(), inplace=True)

In [151]:
dataset['balance'] = dataset['balance'].apply(lambda x: x if x >= 0 else np.nan)
dataset['balance'].fillna(dataset['balance'].median(), inplace=True)

In [154]:
# Transformando a coluna 'age' em inteiro
dataset['age'] = dataset['age'].astype(int)

In [172]:
# Substituir vírgulas por nada (caso haja separadores de milhar) e pontos por ponto final (caso seja separador decimal)
dataset['salary'] = dataset['salary'].replace({',': '', '.': '.'}, regex=True)

# Converter a coluna 'salary' para float
dataset['salary'] = dataset['salary'].astype(float)